jmio/DCN-150/src/Workspace01/Design01.cydsn/Generated_Source/PSoC5/cy_em_eeprom.c
/*******************************************************************************
* Function Name: Cy_Em_EEPROM_Write
****************************************************************************//**
*
* This function takes the logical EEPROM address and converts it to the actual
* physical address and writes data there. If wear leveling is implemented, the
* writing process will use the wear leveling techniques. This is a blocking
* function and it does not return until the write operation is completed. The
* user firmware should not enter Hibernate mode until write is completed. The
* write operation is allowed in Sleep and Deep-Sleep modes. During the flash
* operation, the device should not be reset, including the XRES pin, a software
* reset, and watchdog reset sources. Also, low-voltage detect circuits should
* be configured to generate an interrupt instead of a reset. Otherwise, portions
* of flash may undergo unexpected changes.
*
* \param addr
* The logical start address in EEPROM to start writing data from.
*
* \param eepromData
* Data to write to EEPROM.
*
* \param size
* The amount of data to write to EEPROM.
*
* \param context
* The pointer to the EEPROM context structure \ref cy_stc_eeprom_context_t.
*
* \return
* This function returns \ref cy_en_em_eeprom_status_t.
*
* \note
* This function uses a buffer of the flash row size to perform write
* operation. For the size of the row refer to the specific PSoC device
* datasheet.
*
* \sideeffect
* In case when blocking write option is used, if this function is called by
* the CM4 the user code on CM0P and the user code on CM4 are blocked until erase
* flash row operation is finished. If this function is called by the CM0P the
* user code on CM4 is not blocked and the user code on CM0P is blocked until
* erase flash row operation is finished. Plan your task allocation accordingly.
*
* In case if non-blocking write option is used and when user flash is used as
* an EEPROM storage care should be taken to prevent the read while write (RWW)
* exception. To prevent the RWW exception the user flash macro that includes
* the EEPROM storage should not be read while the EEPROM write is not completed.
* The read also means the user code execution from the respective flash macro.
*
*******************************************************************************/
cy_en_em_eeprom_status_t
    Cy_Em_EEPROM_Write(uint32 addr, void * eepromData, uint32 size, cy_stc_eeprom_context_t * context)
{
    cy_en_em_eeprom_status_t ret = CY_EM_EEPROM_BAD_PARAM;
    uint32 i;
    uint32 wrCnt;
    uint32 actEmEepromRowNum;
    uint32 writeRamBuffer[CY_EM_EEPROM_FLASH_SIZEOF_ROW / CY_EM_EEPROM_U32_DIV];
    uint32 startAddr = 0u;
    uint32 endAddr = 0u;
    uint32 tmpRowAddr;
    uint32 emEepromRowAddr = context->lastWrRowAddr;
    uint32 emEepromRowRdAddr;
    void * tmpData;
    uint32 eeData = (uint32) eepromData; /* To avoid the pointer arithmetic with void */

    /* Check if the EEPROM data does not exceed the EEPROM capacity */
    if((0u != size) && ((addr + size) <= (context->eepromSize)) && (NULL != eepromData))
    {
        uint32 numWrites = ((size - 1u) / CY_EM_EEPROM_HEADER_DATA_LEN) + 1u;
        uint32 eeHeaderDataOffset = 0u;

        for(wrCnt = 0u; wrCnt < numWrites; wrCnt++)
        {
            uint32 skipOperation = 0u;
            /* Get the sequence number of the last written row */
            uint32 seqNum = CY_GET_REG32(emEepromRowAddr);

            /* Get the address of the row to be written. The "emEepromRowAddr" may be
            * updated with the proper address (if wear leveling is used). The
            * "emEepromRowRdAddr" will point to the row address from which the historic
            * data will be read into the RAM buffer.
            */
            GetNextRowToWrite(seqNum, &emEepromRowAddr, &emEepromRowRdAddr, context);

            /* Clear the RAM buffer so to not put junk into flash */
            (void)memset(writeRamBuffer, 0, CY_EM_EEPROM_FLASH_SIZEOF_ROW);

            /* Fill the EM_EEPROM header info for the row in the RAM buffer */
            seqNum++;
            writeRamBuffer[0u] = seqNum;
            writeRamBuffer[1u] = addr;
            tmpData = (void *) eeData;

            /* Check if this is the last row to write */
            if(wrCnt == (numWrites - 1u))
            {
                /* Fill in the remaining size value to the EEPROM header. */
                writeRamBuffer[CY_EM_EEPROM_HEADER_LEN_OFFSET_U32] = size;
            }
            else
            {
                /* This is not the last row to write in the current EEPROM write operation.
                * Write the maximum possible data size to the EEPROM header. Update the
                * size, eeData and addr respectively.
                */
                writeRamBuffer[CY_EM_EEPROM_HEADER_LEN_OFFSET_U32] = CY_EM_EEPROM_HEADER_DATA_LEN;
                size -= CY_EM_EEPROM_HEADER_DATA_LEN;
                addr += CY_EM_EEPROM_HEADER_DATA_LEN;
                eeData += CY_EM_EEPROM_HEADER_DATA_LEN;
            }

            /* Write the data to the EEPROM header */
            (void)memcpy((void *)&writeRamBuffer[CY_EM_EEPROM_HEADER_DATA_OFFSET_U32],
                         tmpData,
                         writeRamBuffer[CY_EM_EEPROM_HEADER_LEN_OFFSET_U32]);

            if(emEepromRowRdAddr != 0UL)
            {
                /* Copy the EEPROM historic data for this row from flash to RAM */
                (void)memcpy((void *)&writeRamBuffer[CY_EM_EEPROM_EEPROM_DATA_OFFSET_U32],
                             (void *)(emEepromRowRdAddr + CY_EM_EEPROM_EEPROM_DATA_LEN),
                             CY_EM_EEPROM_EEPROM_DATA_LEN);
            }

            /* Check if there is data for this location in other EEPROM headers:
            * find out the row with the lowest possible sequence number which
            * may contain the data for the current row.
            */
            i = (seqNum > context->numberOfRows) ? ((seqNum - (context->numberOfRows)) + 1u) : 1u;

            for(; i <= seqNum; i++)
            {
                if(i == seqNum)
                {
                    /* The code reached the row that is about to be written. Analyze the recently
                    * created EEPROM header (stored in the RAM buffer currently): if it contains
                    * the data for EEPROM data locations in the row that is about to be written.
                    */
                    tmpRowAddr = (uint32) writeRamBuffer;
                }
                else
                {
                    /* Retrieve the address of the previously written row by its sequence number.
                    * The pointer will be used to get data from the respective EEPROM header.
                    */
                    tmpRowAddr = GetRowAddrBySeqNum(i, context);
                }

                actEmEepromRowNum = CY_EM_EEPROM_GET_ACT_ROW_NUM_FROM_ADDR(emEepromRowAddr,
                                                                           context->numberOfRows,
                                                                           context->userFlashStartAddr);
                if(0UL != tmpRowAddr)
                {
                    /* Calculate the required addressed for the later EEPROM historic data update */
                    skipOperation = GetAddresses(
                                              &startAddr,
                                              &endAddr,
                                              &eeHeaderDataOffset,
                                              actEmEepromRowNum,
                                              *(uint32 *)(tmpRowAddr + CY_EM_EEPROM_HEADER_ADDR_OFFSET),
                                              *(uint32 *)(tmpRowAddr + CY_EM_EEPROM_HEADER_LEN_OFFSET));
                }
                else
                {
                    /* Skip writes to the RAM buffer */
                    skipOperation++;
                }

                /* Write data to the RAM buffer */
                if(0u == skipOperation)
                {
                    uint32 dataAddr = ((uint32)((uint8 *)&writeRamBuffer)) + startAddr;

