jmio/DCN-150/src/Workspace01/Design01.cydsn/Generated_Source/PSoC5/cy_em_eeprom.c
    }
    return(ret);
}


/*******************************************************************************
* Function Name: Cy_Em_EEPROM_NumWrites
****************************************************************************//**
*
* Returns the number of the EEPROM writes completed so far.
*
* \param context
* The pointer to the EEPROM context structure \ref cy_stc_eeprom_context_t.
*
* \return
* The number of writes performed to the EEPROM.
*
*******************************************************************************/
uint32 Cy_Em_EEPROM_NumWrites(cy_stc_eeprom_context_t * context)
{
    return(CY_GET_REG32(context->lastWrRowAddr));
}

/** \} */

/** \cond INTERNAL */


/*******************************************************************************
* Function Name: FindLastWrittenRow
****************************************************************************//**
*
* Performs a search of the last written row address of the EEPROM associated
* with the context structure. If there were no writes to the EEPROm the
* function returns the start address of the EEPROM. The row address is returned
* in the input parameter.
*
* \param lastWrRowPtr
* The pointer to a memory where the last written row will be returned.
*
* \param context
* The pointer to the EEPROM context structure \ref cy_stc_eeprom_context_t.
*
*******************************************************************************/
static void FindLastWrittenRow(uint32 * lastWrRowPtr, cy_stc_eeprom_context_t * context)
{
    uint32 seqNum = 0u;
    uint32 prevSeqNum = 0u;
    uint32 numRows;
    uint32 emEepromAddr = context->userFlashStartAddr;

    *lastWrRowPtr = emEepromAddr;

    for(numRows = 0u; numRows < (context->numberOfRows * context->wearLevelingFactor); numRows++)
    {
        seqNum = CY_GET_REG32(emEepromAddr);
        if((0u != seqNum) && (seqNum > prevSeqNum))
        {
            /* Some record in EEPROM was found. Store found sequence
            * number and row address.
            */
            prevSeqNum = seqNum;
            *lastWrRowPtr = emEepromAddr;
        }

        /* Switch to the next row */
        emEepromAddr = emEepromAddr + CY_EM_EEPROM_FLASH_SIZEOF_ROW;
    }
}


/*******************************************************************************
* Function Name: GetRowAddrBySeqNum
****************************************************************************//**
*
* Returns the address of the row in EEPROM using its sequence number.
*
* \param seqNum
* The sequence number of the row.
*
* \param context
* The pointer to the EEPROM context structure.
*
* \return
* The address of the row or zero if the row with the sequence number was not
* found.
*
*******************************************************************************/
static uint32 GetRowAddrBySeqNum(uint32 seqNum, cy_stc_eeprom_context_t * context)
{
    uint32 emEepromAddr = context->userFlashStartAddr;

    while(CY_GET_REG32(emEepromAddr) != seqNum)
    {
        /* Switch to the next row */
        emEepromAddr = emEepromAddr + CY_EM_EEPROM_FLASH_SIZEOF_ROW;

        if (CY_EM_EEPROM_ADDR_IN_RANGE !=
            CY_EM_EEPROM_IS_ADDR_EXCEED_RANGE(emEepromAddr, context->wlEndAddr))
        {
            emEepromAddr = 0u;
            /* Exit the loop as we reached the end of EEPROM */
            break;
        }
    }

    return (emEepromAddr);
}


/*******************************************************************************
* Function Name: GetNextRowToWrite
****************************************************************************//**
*
* Performs a range check of the row that should be written and updates the
* address to the row respectively. The similar actions are done for the read
* address.
*
* \param seqNum
* The sequence number of the last written row.
*
* \param rowToWrPtr
* The address of the last written row (input). The address of the row to be 
* written (output).
*
* \param rowToRdPtr
* The address of the row from which the data should be read into the RAM buffer
* in a later write operation. Out parameter.
*
* \param context
* The pointer to the EEPROM context structure \ref cy_stc_eeprom_context_t.
*
*******************************************************************************/
static void GetNextRowToWrite(uint32 seqNum,
        uint32 * rowToWrPtr, uint32 * rowToRdPtr, cy_stc_eeprom_context_t * context)
{
    /* Switch to the next row to be written if the current sequence number is
    * not zero.
    */
    if(0u != seqNum)
    {
        *rowToWrPtr = (*rowToWrPtr + CY_EM_EEPROM_FLASH_SIZEOF_ROW);
    }

    /* If the resulting row address is out of EEPROM, then switch to the base
    * EEPROM address (Row#0).
    */
    if(CY_EM_EEPROM_ADDR_IN_RANGE !=
            CY_EM_EEPROM_IS_ADDR_EXCEED_RANGE(*rowToWrPtr, context->wlEndAddr))
    {
        *rowToWrPtr = context->userFlashStartAddr;
    }

    *rowToRdPtr = 0u;

    /* Check if the sequence number is larger than the number of rows in the EEPROM.
    * If not, do not update the row read address because there is no historic
    * data to be read.
    */
    if(context->numberOfRows <= seqNum)
    {
        /* Check if wear leveling is used in EEPROM */
        if(context->wearLevelingFactor > 1u)
        {
            /* The read row address should be taken from an EEPROM copy that became
            * inactive recently. This condition check handles that.
            */
            if((*rowToWrPtr - (context->numberOfRows * CY_EM_EEPROM_FLASH_SIZEOF_ROW)) <
                context->userFlashStartAddr)
            {
                *rowToRdPtr = context->userFlashStartAddr +
                    (context->numberOfRows * (context->wearLevelingFactor - 1u) *
                        CY_EM_EEPROM_FLASH_SIZEOF_ROW) + (*rowToWrPtr - context->userFlashStartAddr);
            }
            else
            {
                *rowToRdPtr = *rowToWrPtr - (context->numberOfRows * CY_EM_EEPROM_FLASH_SIZEOF_ROW);
            }
        }
        else
        {
            /* If no wear leveling, always read from the same flash row that
            * should be written.
            */
            *rowToRdPtr = *rowToWrPtr;
        }
    }
}


