jmio/DCN-150/src/Workspace01/Design01.cydsn/Generated_Source/PSoC5/cy_em_eeprom.c
/*******************************************************************************
* Function Name: CalcChecksum
****************************************************************************//**
*
* Implements CRC-8 that is used in checksum calculation for the redundant copy
* algorithm.
*
* \param rowData
* The row data to be used to calculate the checksum.
*
* \param len
* The length of rowData.
*
* \return
* The calculated value of CRC-8.
*
*******************************************************************************/
static uint8 CalcChecksum(uint8 rowData[], uint32 len)
{
    uint8 crc = CY_EM_EEPROM_CRC8_SEED;
    uint8 i;
    uint16 cnt = 0u;

    while(cnt != len)
    {
        crc ^= rowData[cnt];
        for (i = 0u; i < CY_EM_EEPROM_CRC8_POLYNOM_LEN; i++)
        {
            crc = CY_EM_EEPROM_CALCULATE_CRC8(crc);
        }
        cnt++;
    }

    return (crc);
}


/*******************************************************************************
* Function Name: CheckRanges
****************************************************************************//**
*
* Checks if the EEPROM of the requested size can be placed in flash.
*
* \param config
* The pointer to a configuration structure. See \ref cy_stc_eeprom_config_t.
*
* \return
* error / status code. See \ref cy_en_em_eeprom_status_t.
*
*******************************************************************************/
static cy_en_em_eeprom_status_t CheckRanges(cy_stc_eeprom_config_t* config)
{
    cy_en_em_eeprom_status_t ret = CY_EM_EEPROM_BAD_DATA;
    uint32 startAddr = config->userFlashStartAddr;
    uint32 endAddr = startAddr + CY_EM_EEPROM_GET_PHYSICAL_SIZE(config->eepromSize,
            config->wearLevelingFactor, config->redundantCopy);

    /* Range check if there is enough flash for EEPROM */
    if (CY_EM_EEPROM_IS_IN_FLASH_RANGE(startAddr, endAddr))
    {
        ret = CY_EM_EEPROM_SUCCESS;
    }
    return (ret);
}


/*******************************************************************************
* Function Name: WriteRow
****************************************************************************//**
*
* Writes one flash row starting from the specified row address.
*
* \param rowAdd
* The address of the flash row.
*
* \param rowData
* The pointer to the data to be written to the row.
*
* \param context
* The pointer to the EEPROM context structure \ref cy_stc_eeprom_context_t.
*
* \return
* error / status code. See \ref cy_en_em_eeprom_status_t.
*
*******************************************************************************/
static cy_en_em_eeprom_status_t WriteRow(uint32 rowAddr, uint32 *rowData,
        cy_stc_eeprom_context_t * context)
{
    cy_en_em_eeprom_status_t ret = CY_EM_EEPROM_WRITE_FAIL;
#if (!CY_PSOC6)
    cystatus rc;
    uint32 rowId;
    #if ((CY_PSOC3) || (CY_PSOC5))
        uint32 arrayId;
    #endif /* (CY_PSOC3) */

    context = context; /* To avoid compiler warning generation */

    /* For non-PSoC 6 devices, the Array ID and Row ID needed to write the row */
    #if (CY_PSOC3)
        
        rowAddr &= CY_EM_EEPROM_CODE_ADDR_MASK;
    #endif /* ((CY_PSOC3) */
    rowId = (rowAddr / CY_EM_EEPROM_FLASH_SIZEOF_ROW) % CY_EM_EEPROM_ROWS_IN_ARRAY;

    /* Write the flash row */
    #if (CY_PSOC4)
        rc = CySysFlashWriteRow(rowId, (uint8 *)rowData);
    #else
        (void)CySetTemp();
        arrayId = rowAddr / CY_FLASH_SIZEOF_ARRAY;
        rc = CyWriteRowData((uint8)arrayId, (uint16)rowId, (uint8 *)rowData);
    #endif /* (CY_PSOC4) */

    if(CYRET_SUCCESS == rc)
    {
        ret = CY_EM_EEPROM_SUCCESS;
    }
#else /* PSoC 6 */
    if(0u != context->blockingWrite)
    {
        /* Do blocking write */
        if(CY_FLASH_DRV_SUCCESS == Cy_Flash_WriteRow(rowAddr, (const uint32 *)rowData))
        {
            ret = CY_EM_EEPROM_SUCCESS;
        }
    }
    else
    {
        /* Initiate write */
        if(CY_FLASH_DRV_OPERATION_STARTED == Cy_Flash_StartWrite(rowAddr, (const uint32 *)rowData))
        {
            uint32 countMs = CY_EM_EEPROM_MAX_WRITE_DURATION_MS;
            cy_en_flashdrv_status_t rc;

            do
            {
                CyDelay(1u);                         /* Wait 1ms */
                rc = Cy_Flash_IsWriteComplete();     /* Check if write completed */
                countMs--;
            }
            while ((rc == CY_FLASH_DRV_OPCODE_BUSY) && (0u != countMs));

            if(CY_FLASH_DRV_SUCCESS == rc)
            {
                ret = CY_EM_EEPROM_SUCCESS;
            }
        }
    }
#endif /* (CY_PSOC6) */

    return (ret);
}


/*******************************************************************************
* Function Name: EraseRow
****************************************************************************//**
*
* Erases one flash row starting from the specified row address. If the redundant
* copy option is enabled the corresponding row in the redundant copy will also
* be erased.
*
* \param rowAdd
* The address of the flash row.
*
* \param ramBuffAddr
* The address of the RAM buffer that contains zeroed data (used only for
* non-PSoC 6 devices).
*
* \param context
* The pointer to the EEPROM context structure \ref cy_stc_eeprom_context_t.
*
* \return
* error / status code. See \ref cy_en_em_eeprom_status_t.
*
*******************************************************************************/
static cy_en_em_eeprom_status_t EraseRow(uint32 rowAddr, uint32 ramBuffAddr,
    cy_stc_eeprom_context_t * context)
{
    uint32 emEepromRowAddr = rowAddr;
    cy_en_em_eeprom_status_t ret = CY_EM_EEPROM_WRITE_FAIL;
#if (CY_PSOC6)
    uint32 i = 1u;

    ramBuffAddr = ramBuffAddr; /* To avoid compiler warning */

    if(0u != context->redundantCopy)
    {
        i++;
    }

    do
    {
        if(0u != context->blockingWrite)
        {
            /* Erase the flash row */
            if(CY_FLASH_DRV_SUCCESS == Cy_Flash_EraseRow(emEepromRowAddr))
            {
                ret = CY_EM_EEPROM_SUCCESS;
            }
        }
        else
        {
            /* Initiate erase */
            if(CY_FLASH_DRV_OPERATION_STARTED == Cy_Flash_StartErase(emEepromRowAddr))
            {
                uint32 countMs = CY_EM_EEPROM_MAX_WRITE_DURATION_MS;
                cy_en_flashdrv_status_t rc;

                do
                {
                    CyDelay(1u);                         /* Wait 1ms */
                    rc = Cy_Flash_IsWriteComplete();     /* Check if erase completed */
                    countMs--;
                }
                while ((rc == CY_FLASH_DRV_OPCODE_BUSY) && (0u != countMs));

